In [1]:
## Pandas Provide data sturcture to store data

# Series In Panda

In [11]:
import pandas as pd

In [12]:
s1 = pd.Series([1,2,3,4])      # Creating Series with List
s1                             # o,1,2,3 is key &&& 1,2,3,4 is value

0    1
1    2
2    3
3    4
dtype: int64

In [13]:
type(s1)

pandas.core.series.Series

In [17]:
s2 = pd.Series(([1,2,3,4]), index=(["a","b","c","d"]))   # We can also assign custom index
s2

a    1
b    2
c    3
d    4
dtype: int64

In [25]:
s3 =pd.Series({'a':1,'b':2,'c':3, 'd':4})      # Creating Series with Dictionary
s3

a    1
b    2
c    3
d    4
dtype: int64

In [23]:
type(s3)

pandas.core.series.Series

In [37]:
s3 =pd.Series({'a':1,'b':2,'c':3, 'd':4}, index =["w","a","y","b"])     # Repositioning Indexes

s3

w    NaN
a    1.0
y    NaN
b    2.0
dtype: float64

In [39]:
s2[2]  # Exract spacific value

3

In [42]:
s2[1:]   # Exract spacific range of value

b    2
c    3
d    4
dtype: int64

In [47]:
s4 = pd.Series([1,2,3,4,5,6,7,8,9])
s4

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [49]:
s4+2                     # adding 2 in s4(Each element plus 2 hu jai ga)

0     3
1     4
2     5
3     6
4     7
5     8
6     9
7    10
8    11
dtype: int64

# DataFrame (Important)

In [51]:
# Provide Rows and Columns just like excel Sheet
# 2d label data structure

In [53]:
import pandas as pd

In [67]:
es1 =pd.DataFrame({"Names":["Yasir","Bilal","Sunny"],"Ids":[100,244,155]})                              #Important

In [68]:
es1

   Names  Ids
0  Yasir  100
1  Bilal  244
2  Sunny  155

In [69]:
type(es1)

pandas.core.frame.DataFrame

In [108]:
y1 = pd.DataFrame({                                           # DO PRACITCE ALOT
    "Name":["Yasir","Bilal","Sunny"],
    "Department":["COICS","BBA","Eng"],
    "Sallary":[10000,50000,12341],
    "ProLang":["Python","None","None"]})
y1

    Name Department  Sallary ProLang
0  Yasir      COICS    10000  Python
1  Bilal        BBA    50000    None
2  Sunny        Eng    12341    None

In [109]:
#!     Formate for making datadrames
pd.DataFrame({ 
    "Name":[],
    "Ids":[],
    "Sono..":[]
})

Empty DataFrame
Columns: [Name, Ids, Sono..]
Index: []

# Methods Of DataFrames/

In [110]:
# Function In DataFrames : 
# (i): head():  To see First 5 rows of DataFrame
# (ii): shape(): To find no.of rows/columns in a DataFrame
# (ii): describe(): General Info About DataFrame
# (iv): tail(): To see Last 5 rows of DataFrame
# (v): drop(): Use to Drop row or coumn (e.g={ y1.drop("Name",axis = 1)   })
# (vi): iloc[]
# (vii): loc[]

In [111]:
# Method To Read CSV File :
# E.g:
#    iras = pd.read_csv("filename.csv")

In [112]:
y1.shape   # shape(): To find no.of rows/columns in a DataFrame

(3, 4)

In [113]:
y1.describe

<bound method NDFrame.describe of     Name Department  Sallary ProLang
0  Yasir      COICS    10000  Python
1  Bilal        BBA    50000    None
2  Sunny        Eng    12341    None>

In [114]:
#  iloc[] : Use to extract data from DatFrame

In [115]:
y1.iloc[0:1 , 0:1]      # Extacting 1st row and 1st col from y1

    Name
0  Yasir

In [118]:
y1.loc[0:2,"Department"]   # Extracting by name of calumn

0    COICS
1      BBA
2      Eng
Name: Department, dtype: object

# Basic Function In Pandas

##### 1 . Mean()
##### 2 . Median()
##### 3 . Maximum()  => max()
##### 4 . Minimun()   => min()

In [123]:
y1.min()

Name          Bilal
Department      BBA
Sallary       10000
ProLang        None
dtype: object

In [124]:
y1.max()

Name           Yasir
Department       Eng
Sallary        50000
ProLang       Python
dtype: object

In [136]:
def half(data):
    return data/2               # Custom Function to half something

y1[["Sallary"]].apply(half)       # Applying half funciton to half the sallaries

   Sallary
0   5000.0
1  25000.0
2   6170.5

In [149]:
y1["Name"].value_counts()           # Count specific value occur

Yasir    1
Sunny    1
Bilal    1
Name: Name, dtype: int64

In [150]:
y1.sort_values(by="Sallary")         # Sorting entries

    Name Department  Sallary ProLang
0  Yasir      COICS    10000  Python
2  Sunny        Eng    12341    None
1  Bilal        BBA    50000    None

### THE END